#использовать "../src/core"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьМаксимальнаяВерсияМежду");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингОпций");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингМассивовОпций");

	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьМаксимальнаяВерсияМежду() Экспорт

	

КонецПроцедуры

Функция ТестовыйСлучай(Знач ВерсииПроверки, Знач НижнийДиапазон, Знач ВерхнийДиапазон, Знач Результат)

	Тест = Новый Структура;
	Тест.Вставить("ВерсииПроверки",СтрРазделить(ВерсииПроверки, " "));
	Тест.Вставить("НижнийДиапазон",НижнийДиапазон);
	Тест.Вставить("ВерхнийДиапазон",ВерхнийДиапазон);
	Тест.Вставить("Результат",Результат);

	Возврат Тест;
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.lib.yaml");
//Лог.УстановитьУровень(УровниЛога.Отладка);